---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalDemandCurrentParam
source: html/a6408c01-d753-0fed-6c25-3dde0f1db663.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalDemandCurrentParam Property

"Total Estimated Demand Current"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelTotalDemandCurrentParam { get; }
```